package Database;

import java.io.File;
import java.util.ArrayList;

public class CardList{
	ArrayList<Card> info = new ArrayList<Card>();
	ArrayList<String> cardinfo = new ArrayList<String>();
	public ArrayList<Card> unlimitedinfo(){
		info.add(new Card("R","큐트","하야사카 미레이",false,27,2914,2905,2964,29,3623,3612,3685,
				"p","할퀴어 버릴거야",false,"a",13,30,6,0,0,10));
		info.add(new Card("R","큐트","하라다 미요",false,30,2554,3008,2464,32,3175,3740,3064,
				"h","나이스 핸들링",false,"l",9,30,4,2,0,10));
		info.add(new Card("R","큐트","효도 레나",false,27,2510,3857,2072,29,3121,4795,2576,
				"s","풀하우스",false,"d",9,30,6,10,0,30));
		info.add(new Card("R","큐트","모모이 아즈키",false,27,2473,3875,2025,29,3074,4817,2518,
				"c","우당탕 대작전",false,"d",7,30,5,8,0,30));
		info.add(new Card("R","큐트","도묘지 카린",false,30,2674,2664,2719,32,3325,3312,3380,
				"h","건강기원",false,"l",13,30,6,2,0,10));
		info.add(new Card("R","큐트","코시미즈 사치코",false,27,2510,2084,3801,29,3121,2591,4725,
				"c","자칭˙어필타임",false,"i",6,30,4,8,0,30));	
		info.add(new Card("R","큐트","아베 나나",false,27,2869,2967,2885,29,3567,3689,3587,
				"p","메르헨 체인지",false,"l",9,30,4,0,0,10));
		info.add(new Card("R","큐트","후타바 안즈",false,27,2632,2616,2613,29,3272,3252,3249,
				"p","적당히",false,"s",11,30,5,0,0,15));
		info.add(new Card("R","큐트","코바야카와 사에",false,27,3864,2478,2033,29,4803,3080,2527,
				"c","화사한 노래",false,"v",9,30,6,8,0,30));
		info.add(new Card("R","큐트","미야모토 프레데리카",false,27,2895,2934,2902,29,3599,3647,3608,
				"h","소악마 키스",false,"s",11,30,5,2,0,15));
		info.add(new Card("R","큐트","마에카와 미쿠",false,30,2396,2450,2405,32,2979,3046,2990,
				"h","네코 어필",false,"l",9,30,4,2,0,10));
		info.add(new Card("R","큐트","시마무라 우즈키",false,27,1815,2221,3497,29,2257,2761,4347,
				"s","퍼스트 스마일",false,"i",6,30,4,10,0,30));
		info.add(new Card("R","큐트","사키키바라 사토미",false,27,2105,3864,2539,29,2618,4803,3156,
				"s","천연 바디",false,"d",7,30,5,10,0,30));
		info.add(new Card("R","큐트","야오 페이페이",false,27,2539,2105,3864,29,3156,2618,4803
				,"s","홍콩풍 춤",false,"i",6,30,4,10,0,30));
		info.add(new Card("R","큐트","오오니시 유리코",false,27,2532,2078,3945,29,3148,2583,4904,
				"s","음흉한 토크",false,"i",7,30,5,10,0,30));
		info.add(new Card("R","큐트","아무라 세츠나",false,27,3852,2076,2513,29,4789,2581,3124,
				"s","메이크 업",false,"v",7,30,5,10,0,30));
		info.add(new Card("R","큐트","츠키미야 미야비",false,27,2550,3843,2121,29,3170,4777,2637,
				"c","엄마랑 닮은꼴",false,"d",6,30,4,8,0,30));
		info.add(new Card("R","큐트","시라기쿠 호타루",false,30,2728,2669,2656,32,3391,3319,3302,
				"p","포기하지 않는 마음",true,"l",12,30,4,0,0,10));
		info.add(new Card("R","큐트","사쿠마 마유",false,27,3938,1974,2442,29,4896,2454,3036,
				"s","리본 어필",false,"v",7,30,5,10,0,30));
		info.add(new Card("R","큐트","클라리스",false,27,2063,3828,2497,29,2565,4759,3104,
				"s","성스러운 노랫소리",false,"d",6,30,4,10,0,30));
		info.add(new Card("R","큐트","사이온지 코토카",false,27,1958,2431,3959,29,2435,3022,4922,
				"s","밀레이디 포즈",false,"i",9,30,6,10,0,30));
		info.add(new Card("R","큐트","쿠도 시노부",false,27,3859,2482,2037,29,4797,3086,2532,
				"c","첫걸음",false,"v",6,30,4,8,0,30));
		info.add(new Card("R","큐트","아리우라 칸나",false,27,3061,2865,2897,29,3805,3562,3601,
				"s","사랑의 노래",false,"a",7,30,5,10,0,10));
		info.add(new Card("R","큐트","쿠리하라 네네",false,30,2716,2697,2806,32,3377,3353,3489,
				"h","힘이 나는 주문",false,"l",11,30,5,2,0,10));
		info.add(new Card("R","큐트","오오누마 쿠루미",false,30,2711,2817,2690,32,3371,3503,3345,
				"h","영양 가득",false,"l",13,30,6,2,0,10));
		info.add(new Card("R","쿨","와쿠이 루미",false,27,2518,2071,3906,29,3130,2575,4856,
				"p","프레젠테이션",false,"i",13,30,6,0,0,30));
		info.add(new Card("R","쿨","오카자키 야스하",false,30,2896,2552,2610,32,3600,3173,3245,
				"h","이노센트 보이스",false,"l",9,30,4,2,0,10));
		info.add(new Card("R","쿨","시라사카 코우메",false,27,2880,2860,2978,29,3581,3556,3702,
				"h","괴담",false,"l",11,30,5,2,0,10));
		info.add(new Card("R","쿨","아야세 호노카",false,27,2499,3822,2067,29,3106,4751,2570,
				"c","발레 스텝",false,"d",7,30,5,8,0,30));
		info.add(new Card("R","쿨","사죠 유키미",false,30,2673,2708,2678,32,3323,3366,3329,
				"h","퓨어 힐",false,"l",13,30,6,2,0,10));
		info.add(new Card("R","쿨","아나스타샤",false,30,2414,2411,2430,32,3001,2997,3021,
				"h","아이스 스마일",false,"l",9,30,4,2,0,10));
		info.add(new Card("R","쿨","하야미 카나데",false,27,2075,2505,3812,29,2580,3115,4739,
				"c","유혹의 키스",false,"i",6,30,4,8,0,30));
		info.add(new Card("R","쿨","호죠 카렌",false,27,2924,2907,2904,29,3635,3614,3611,
				"p","퓨어 워시",false,"s",9,30,4,0,0,15));
		info.add(new Card("R","쿨","칸자키 란코",false,27,2611,2603,2643,29,3246,3236,3286,
				"p","타락천사의 날개",false,"s",11,30,5,0,0,15));
		info.add(new Card("R","쿨","타카가키 카에데",false,27,3843,2050,2489,29,4777,2549,3094,
				"c","아우라",false,"v",9,30,6,8,0,30));
		info.add(new Card("R","쿨","시부야 린",false,27,3444,1857,2247,29,4281,2309,2793,
				"s","간직한 의지",false,"v",6,30,4,10,0,30));
		info.add(new Card("R","쿨","타카하시 레이코",false,30,2644,2887,2596,32,3287,3589,3228,
				"p","어른의 여유",true,"l",15,30,5,0,0,10));
		info.add(new Card("R","쿨","키바 마나미",false,30,2644,2887,2596,32,3287,3589,3228,
				"h","스토익 바디",false,"s",13,30,6,2,0,15));
		info.add(new Card("R","쿨","우메키 오토하",false,27,2791,3155,2851,29,3470,3923,3544,
				"c","퓨어 보이스",false,"s",6,30,4,8,0,15));
		info.add(new Card("R","쿨","오오이시 이즈미",false,27,2009,2471,3936,29,2498,3072,4893,
				"c","코딩",false,"i",7,30,5,8,0,30));
		info.add(new Card("R","쿨","후지이 토모",false,27,3920,2022,2478,29,4873,2514,3081,
				"s","스피리츄얼 파워",false,"v",9,30,6,10,0,30));
		info.add(new Card("R","쿨","라일라",false,27,2047,3889,2494,29,2545,4835,3101,
				"s","즐거운 수다",false,"d",7,30,5,10,0,30));
		info.add(new Card("R","쿨","유우키 하루",false,27,2895,2909,2974,29,3599,3617,3697,
				"p","강한 시선",false,"s",13,30,6,0,0,15));
		info.add(new Card("R","쿨","미즈노 미도리",false,27,3954,2033,2495,29,4916,2528,3102,
				"s","숨 고르기",false,"v",6,30,4,10,0,30));
		info.add(new Card("R","쿨","야가미 마키노",false,27,2457,3962,1988,29,3054,4925,2472,
				"s","정보분석",false,"d",9,30,6,10,0,30));
		info.add(new Card("R","쿨","모리쿠보 노노",false,27,3969,2426,1949,29,4934,3016,2423,
				"s","작은 노력",false,"v",7,30,5,10,0,30));
		info.add(new Card("R","쿨","와키야마 타마미",false,30,2651,2764,2628,32,3296,3436,3268,
				"p","기합",true,"l",12,30,4,0,0,10));
		info.add(new Card("R","쿨","니노미야 아스카",false,27,2499,2067,3822,29,3107,2570,4751,
				"s","익스텐드 컬러",false,"i",9,30,6,8,0,30));
		info.add(new Card("R","쿨","마츠나가 료",false,27,1966,3948,2436,29,2445,4908,3028,
				"s","라우드 보이스",false,"d",6,30,4,10,0,30));
		info.add(new Card("R","쿨","야마토 아키",false,27,2064,2505,3868,29,2567,3115,4809,
				"s","서바이벌 정신",false,"i",6,30,4,10,0,30));
		info.add(new Card("R","쿨","케이트",false,27,2909,3105,2869,29,3617,3860,3567,
				"s","잉글리쉬 송",false,"a",7,30,5,10,0,10));
		info.add(new Card("R","패션","츠치야 아코",false,27,3862,2508,2068,29,4801,3118,2571,
				"c","머니 어필",false,"v",7,30,5,8,0,30));
		info.add(new Card("R","패션","미요시 사나",false,27,2861,2887,3018,29,3557,3589,3752,
				"p","게이머 사고",false,"s",11,30,5,0,0,15));
		info.add(new Card("R","패션","코세키 레이나",false,27,2081,2515,3847,29,2588,3127,4783,
				"s","장난 타임",false,"i",6,30,4,10,0,30));
		info.add(new Card("R","패션","남바 에미",false,27,3931,2013,2473,29,4887,2503,3075,
				"s","츳코미 캐릭터",false,"v",9,30,6,10,0,30));
		info.add(new Card("R","패션","무라카미 토모에",false,27,3967,2455,1984,29,4931,3052,2467,
				"c","여자의 의지",false,"v",6,30,4,8,0,30));
		info.add(new Card("R","패션","키타 히나코",false,27,2487,2046,3849,29,3092,2544,4785,
				"s","소녀의 망상",false,"i",7,30,5,10,0,30));
		info.add(new Card("R","패션","무카이 타쿠미",false,27,2476,3870,2029,29,3078,4811,2523,
				"s","해프닝 키스",false,"d",6,30,4,10,0,30));
		info.add(new Card("R","패션","이치하라 니나",false,27,2054,2492,3838,29,2554,3098,4771,
				"s","창작 댄스",false,"i",9,30,6,10,0,30));
		info.add(new Card("R","패션","메어리 코크란",false,27,3964,1953,2429,29,4928,2428,3020,
				"s","레이디의 품격",false,"v",7,30,5,10,0,30));
		info.add(new Card("R","패션","하마구치 아야메",false,30,2624,2649,2769,32,3262,3294,3442,
				"p","스테이지 백화요란",false,"l",13,30,6,0,0,10));
		info.add(new Card("R","패션","와카바야시 토모카",false,27,2042,3854,2484,29,2539,4791,3088,
				"c","치어댄스",false,"d",7,30,5,8,0,30));
		info.add(new Card("R","패션","센자키 에마",false,27,2896,2886,2946,29,3600,3588,3663,
				"h","하이텐션",false,"s",11,30,5,2,0,15));
		info.add(new Card("R","패션","나탈리아",false,27,3791,2515,2092,29,4713,3127,2601,
				"c","정열 어필",false,"v",9,30,6,8,0,30));
		info.add(new Card("R","패션","토토키 아이리",false,27,2956,2891,2877,29,3675,3594,3576,
				"p","천연 해프닝",false,"l",9,30,4,0,0,10));
		info.add(new Card("R","패션","모로보시 키라리",false,30,2440,2409,2404,32,3034,2995,2989,
				"h","해피해피 포즈",false,"l",9,30,4,2,0,10));
		info.add(new Card("R","패션","히노 아카네",false,30,2699,2683,2680,32,3355,3335,3332,
				"h","전력 트라이",false,"l",13,30,6,2,0,10));
		info.add(new Card("R","패션","죠가사키 리카",false,27,2604,2595,2654,29,3237,3226,3300,
				"p","미니 GAL의 의지",false,"s",11,30,5,0,0,15));
		info.add(new Card("R","패션","죠가사키 미카",false,27,2494,2058,3833,29,3100,2558,4765,
				"c","GAL의 의지",false,"i",6,30,4,8,0,30));
		info.add(new Card("R","패션","혼다 미오",false,27,1882,3413,2263,29,2340,4243,2813,
				"s","포지티브 어필",false,"d",6,30,4,10,0,30));
		info.add(new Card("R","패션","코마츠 이부키",false,27,2492,3959,2029,29,3098,4922,2523,
				"s","유혹하는 댄스",false,"d",7,30,5,10,0,30));
		info.add(new Card("R","패션","나미키 메이코",false,30,2896,2640,2589,32,3600,3282,3219,
				"p","여행 기분",true,"l",12,30,4,0,0,10));
		info.add(new Card("R","패션","키타가와 마히로",false,27,2539,3864,2105,29,3156,4803,2618,
				"c","포지티브 대쉬",false,"d",9,30,6,8,0,30));
		info.add(new Card("R","패션","마키하라 시호",false,27,3875,2096,2534,29,4817,2606,3150,
				"s","스마일 오더",false,"v",6,30,4,10,0,30));
		info.add(new Card("R","패션","니시지마 카이",false,27,2087,2537,3935,29,2595,3154,4892,
				"p","에네르기시 스트로크",false,"i",12,30,4,0,0,30));
		info.add(new Card("R","패션","에토 미사키",false,30,2806,2697,2716,32,3489,3353,3377,
				"h","반짝이는 여자력",false,"i",9,45,6,2,0,10));
		info.add(new Card("R","패션","난죠 히카루",false,27,2070,3956,2527,29,2574,4918,3142,
				"p","소원의 힘",true,"d",15,30,5,0,0,30));
		/////////////////////////////////////////////////////////////////////
		info.add(new Card("SR","큐트","[섹시 캣] 마에카와 미쿠",false,37,3107,2577,4715,39,3792,3145,5755,
				"s","냥냥 아이즈",false,"i",9,35,5,15,0,60));
		info.add(new Card("SR","큐트","[포근한 스마일] 미무라 카나코",false,37,4862,3034,2460,39,5934,3703,3003,
				"s","감사의 마법",false,"v",11,35,6,15,0,60));
		info.add(new Card("SR","큐트","[수줍은 소녀] 코히나타 미호",false,37,3620,3603,3600,39,4419,4398,4394,
				"p","수줍은 미소",true,"s",12,35,5,0,0,30));
		info.add(new Card("SR","큐트","[소악마 메이드] 미야모토 프레데리카",false,37,2544,4757,3086,39,3106,5806,3766,
				"s","달콤한 유혹",false,"d",7,35,4,15,0,60));
		info.add(new Card("SR","큐트","[퓨어리 걸] 오쿠야마 사오리",false,37,3547,3685,3570,39,4329,4498,4357,
				"p","소박한 마음",false,"s",9,35,3,0,0,30));
		info.add(new Card("SR","큐트","[겨울의 멜로디] 오가타 치에리",false,41,3286,3259,3421,43,4011,3978,4175,
				"h","작은 마음",false,"l",11,35,4,3,0,20));
		info.add(new Card("SR","큐트","[리틀 프린세스] 후쿠야마 마이",false,41,3362,3315,3307,43,4104,4046,4037,
				"m","우아한 한때",false,"l",11,35,6,0,0,20));
		info.add(new Card("SR","큐트","[퍼퓸 트리퍼] 이치노세 시키",false,37,3081,4767,2535,39,3761,5818,3094,
				"s","눈뜨는 향기",false,"d",6,35,3,15,0,60));
		info.add(new Card("SR","큐트","[파이팅 치어] 나카노 유카",false,37,2569,3102,4725,39,3136,3786,5767,
				"s","열심히 응원!",false,"i",9,35,5,15,0,60));
		info.add(new Card("SR","큐트","[매지컬☆프리티 하트] 요코야마 치카",false,37,2517,4838,3079,39,3072,5905,3758,
				"s","매지컬☆프리티 체인지",false,"d",6,35,3,15,0,60));
		info.add(new Card("SR","큐트","[해피 매지션] 쿠도 시노부",false,37,4848,3074,2509,39,5917,3752,3063,
				"s","마법의 실크햇",false,"v",4,35,2,15,0,60));
		info.add(new Card("SR","큐트","[장밋빛 공주님] 사쿠라이 모모카",false,41,3053,3164,3724,43,3727,3862,4546,
				"h","공주님의 기지개",false,"l",17,35,6,3,0,20));
		info.add(new Card("SR","큐트","[팬시 걸] 이마이 카나",false,41,3073,3744,3185,43,3751,4570,3888,
				"h","이노센트 스마일",false,"l",11,35,4,3,0,20));
		info.add(new Card("SR","큐트","[청순한 아가씨] 미즈모토 유카리",false,37,4866,2533,3098,39,5939,3092,3781,
				"p","꿈의 무대",false,"s",7,40,2,0,0,30));
		info.add(new Card("SR","큐트","[꽃밭의 봄바람] 사이온지 코토카",false,41,3265,3583,3202,43,3985,4373,3909,
				"m","봄바람의 숨결",false,"l",7,35,4,0,0,20));
		info.add(new Card("SR","큐트","[비치 웨이브] 무라마츠 사쿠라",false,37,2608,3154,4821,39,3184,3850,5884,
				"p","웨이브 스마일",false,"i",9,35,3,0,0,60));
		info.add(new Card("SR","큐트","[선샤인 비치] 도묘지 카린 ",false,37,2582,4853,3138,39,3151,5924,3830,
				"p","한여름의 엑시던트",false,"i",9,35,3,0,0,60));
		info.add(new Card("SR","큐트","[드라이브 섬머] 하라다 미요",false,37,4811,3159,2616,39,5872,3856,3193,
				"o","톱 스피드",false,"i",9,35,16,5,15,60));
		info.add(new Card("SR","쿨","[안경 프린세스] 카미죠 하루나",false,37,2451,4872,3029,39,2992,5946,3697,
				"s","안경 파워",false,"d",6,35,15,15,0,60));
		info.add(new Card("SR","쿨","[꼬마 스테이지] 와키야마 타마미",false,37,3140,4782,2600,39,3833,5836,3173,
				"s","진검승부",false,"d",4,40,2,15,0,60));
		info.add(new Card("SR","쿨","[질풍의 스트라이커] 유우키 하루",false,37,3066,2483,4929,39,3742,3031,6016,
				"p","오버헤드 슛",false,"i",12,35,4,0,0,60));
		info.add(new Card("SR","쿨","[치유의 여신] 미후네 미유",false,37,3532,3827,3473,39,4311,4671,4239,
				"p","치유의 노랫소리",false,"s",18,35,6,0,0,30));
		info.add(new Card("SR","쿨","[영원한 공주님] 카와시마 미즈키",false,41,3029,3149,3754,43,3697,3843,4582,
				"m","어른의 아우라",false,"l",7,35,4,0,0,20));
		info.add(new Card("SR","쿨","[신비의 여신] 타카가키 카에데",false,37,3044,2476,4841,39,3715,3022,5908,
				"s","신비한 아우라",false,"i",11,35,6,15,0,60));
		info.add(new Card("SR","쿨","[반짝이는 소녀] 호죠 카렌",false,41,3341,3326,3323,43,4078,4060,4056,
				"h","빛나는 미소",false,"l",11,35,4,3,0,20));
		info.add(new Card("SR","쿨","[미소의 여신] 닛타 미나미",false,37,4736,2560,3097,39,5780,3125,3780,
				"s","미소의 매력",false,"v",9,35,5,15,0,60));
		info.add(new Card("SR","쿨","[신춘 록커] 타다 리이나",false,37,3065,4799,2510,39,3741,5857,3064,
				"s","뉴록 어필",false,"d",7,35,4,15,0,60));
		info.add(new Card("SR","쿨","[스타리 비치] 아나스타샤",false,37,3581,3565,3663,39,4371,4351,4471,
				"p","끝없는 바다",true,"s",12,35,5,0,0,30));
		info.add(new Card("SR","쿨","[쁘띠 마드모아젤] 사죠 유키미",false,37,3729,3548,3513,39,4551,4330,4288,
				"p","미스테리어스 스마일",false,"s",9,35,3,0,0,30));
		info.add(new Card("SR","쿨","[블루 플로트 파티] 아라키 히나",false,41,3275,3242,3441,43,3997,3957,4200,
				"m","터져나오는 자신",false,"l",11,35,6,0,0,20));
		info.add(new Card("SR","쿨","[록킹 보컬리스트] 마츠나가 료",false,41,3301,3391,3283,43,4030,4139,4007,
				"h","드라이브 샤우트",false,"l",8,35,3,3,0,20));
		info.add(new Card("SR","쿨","[나이트 엘레강스] 아이카와 치나츠",false,37,4872,3029,2451,39,5946,3697,2992,
				"s","야상의 노래",false,"v",9,35,5,15,0,60));
		info.add(new Card("SR","쿨","[쇼콜라 발렌타인] 모리쿠보 노노",false,37,2517,3079,4838,39,3072,3758,5905,
				"s","러블리 초콜렛",false,"i",7,35,4,15,0,60));
		info.add(new Card("SR","쿨","[두근두근☆챌린지] 아야세 호노카",false,41,3180,3754,3064,43,3882,4582,3740,
				"h","상냥한 마음",false,"l",11,35,4,3,0,20));
		info.add(new Card("SR","쿨","[섹시 뷰티] 마츠모토 사리나",false,37,4856,2541,3103,39,5927,3101,3787,
				"o","유혹 어필",false,"v",7,35,4,16,11,60));
		info.add(new Card("SR","쿨","[아름다운 신부] 와쿠이 루미",false,37,4898,3082,2508,39,5978,3762,3062,
				"s","행복의 종",false,"v",11,40,5,15,0,60));
		info.add(new Card("SR","쿨","[네이비 웨이브] 오오이시 이즈미",false,37,3653,3261,3182,39,4458,3981,3884,
				"h","웨이브 송",false,"s",17,35,6,3,0,60));
		info.add(new Card("SR","쿨","[포츈★스타] 후지이 토모",false,37,2612,4816,3156,39,3189,5878,3852,
				"p","행복의 전조",false,"d",18,35,6,0,0,60));
		info.add(new Card("SR","패션","[알레그로 기분] 마츠야마 쿠미코 ",false,37,2541,4856,3103,39,3101,5927,3787,
				"s","피아니시모 터치",false,"d",9,35,5,15,0,60));
		info.add(new Card("SR","패션","[남국의 무희] 마츠야마 쿠미코 ",false,37,3069,4859,2501,39,3746,5931,3053,
				"s","아름다음에 건 마음",false,"d",6,35,3,15,0,60));
		info.add(new Card("SR","패션","[나니와의 화려한 아가씨] 남바 에미",false,41,3714,3169,3061,43,4533,3868,3736,
				"h","나니와 리듬",false,"l",14,35,5,3,0,20));
		info.add(new Card("SR","패션","[록킹 러버] 키무라 나츠키",false,37,3559,3530,3707,39,4344,4309,4525,
				"p","오버 드라이브",false,"s",9,35,3,0,0,30));
		info.add(new Card("SR","패션","[스위트 발렌타인] 토토키 아이리",false,37,2527,3076,4778,39,3085,3755,5832,
				"s","스위트 포 유",false,"i",11,35,6,15,0,60));
		info.add(new Card("SR","패션","[복슬복슬 꼬리] 아카기 미리아",false,41,3274,3401,3295,43,3996,4151,4022,
				"h","푹신푹신 타임",false,"l",11,35,4,3,0,20));
		info.add(new Card("SR","패션","[카리스마 GAL] 죠가사키 미카",false,37,4694,3118,2594,39,5729,3806,3166,
				"s","핑키하트 블러섬",false,"v",7,35,4,15,0,60));
		info.add(new Card("SR","패션","[카리스마 미니 GAL] 죠가사키 리카",false,37,2493,4820,3055,39,3043,5883,3729,
				"s","풀파워 러브어택",false,"d",9,35,5,15,0,60));
		info.add(new Card("SR","패션","[전력 치어걸] 히메카와 유키",false,37,3582,3641,3593,39,4372,4444,4386,
				"p","머신건 응원",true,"s",12,35,5,0,0,30));
		info.add(new Card("SR","패션","[선플라워 옐로] 류자키 카오루",false,41,3290,3381,3306,43,4016,4126,4035,
				"m","해바라기 스마일",false,"l",11,35,6,0,0,20));
		info.add(new Card("SR","패션","[부드러운 소녀] 타카모리 아이코",false,37,3039,2468,4851,39,3709,3013,5920,
				"p","부드러운 미소",false,"i",12,35,4,0,0,60));
		info.add(new Card("SR","패션","[프레쉬 치어걸] 와카바야시 토모카",false,41,3452,3270,3234,43,4214,3991,3947,
				"p","치어풀 댄스!",true,"l",10,35,4,0,0,20));
		info.add(new Card("SR","패션","[문라이트 플라워] 아이바 유미",false,37,3576,3556,3674,39,4365,4341,4484,
				"s","문라이트 부케",false,"s",11,35,6,15,0,30));
		info.add(new Card("SR","패션","[데인져러스 어덜티] 카타기리 사나에",false,37,2534,3090,4817,39,3093,3772,5879,
				"s","파이트 한 발",false,"i",9,35,5,15,0,60));
		info.add(new Card("SR","패션","[일진 소녀] 무카이 타쿠미",false,37,3084,2526,4827,39,3764,3084,5891,
				"s","누님의 미소",false,"i",4,35,2,15,0,60));
		info.add(new Card("SR","패션","[소녀의 공부] 메어리 코크란",false,37,3593,3707,3569,39,4386,4525,4356,
				"p","공부의 성과",false,"s",6,35,2,0,0,30));
		info.add(new Card("SR","패션","[천일야화 무희] 나탈리아",false,37,4922,3037,2450,39,6008,3707,2991,
				"s","셀헤라자드 댄스",false,"v",9,35,5,15,0,60));
		info.add(new Card("SR","패션","[화려한 쿠노이치] 하마구치 아야메",false,37,3486,3548,3859,39,4255,4330,4710,
				"p","아이돌 변신 인술",false,"s",18,35,6,0,0,30));
		info.add(new Card("SR","패션","[인형옷 푹신푹신] 이치하라 니나",false,41,3323,3341,3432,43,4056,4078,4189,
				"m","인형옷 파워",false,"l",7,35,4,0,0,20));
		info.add(new Card("SR","패션","[고민할 나이] 야구치 미우",false,41,3089,3195,3724,43,3771,3900,4546,
				"h","포지티브 챌린지",false,"l",17,35,6,3,0,20));
		info.add(new Card("SR","패션","[설퍼 웨이브] 츠치야 아코",false,37,3148,2599,4832,39,3842,3172,5898,
				"s","웨이브 댄스",false,"i",7,40,3,15,0,60));
		info.add(new Card("SR","패션","[스쿨 데빌] 코세키 레이나",false,37,4832,2599,3148,39,5898,3172,3842,
				"o","장난 스피커",false,"i",7,35,16,4,11,60));
		///////////////////////////////////////////////////////////////////////////////////////////
		info.add(new Card("SR","큐트","[프리티 파티쉐] 나카노 유카",true,41,3547,3194,3252,43,4329,3899,3969,
				"m","스위트 쿠킹",false,"s",9,35,5,0,0,30));
		info.add(new Card("SR","큐트","[모범생/고냥이] 마에카와 미쿠",true,37,3119,4824,2567,39,3807,5888,3134,
				"p","갈아쓰는 고양이귀",false,"d",9,35,3,0,0,60));
		info.add(new Card("SR","큐트","[자칭 귀요미] 코시미즈 사치코",true,37,2466,3056,4950,39,3010,3730,6041,
				"s","자칭 넘쳐흐르는 반짝임",false,"i",9,35,5,15,0,60));
		info.add(new Card("SR","큐트","[스위트 크리스마스] 이가라시 쿄코",true,37,3036,2464,4857,39,3706,3008,5928,
				"s","스위트 프레젠트",false,"i",7,35,4,15,0,60));
		info.add(new Card("SR","큐트","[대기만성] 도묘지 카린",true,41,3160,3734,3044,43,3857,4557,3715,
				"h","열심히",false,"l",14,35,5,3,0,20));
		info.add(new Card("SR","쿨","[흑진주의 반짝임] 쿠로카와 치아키",true,41,3037,3155,3744,43,3707,3851,4570,
				"h","고상한 미소",false,"l",14,35,5,3,0,20));
		info.add(new Card("SR","쿨","[할로윈 나이트메어] 시라사카 코우메",true,37,2485,3050,4830,39,3034,3723,5895,
				"s","나이트메어 송",false,"i",7,35,4,12,0,60));
		info.add(new Card("SR","쿨","[작은 자신가] 와키야마 타마미",true,37,4827,2526,3084,39,5891,3084,3764,
				"p","올곧은 마음",false,"v",9,35,3,0,0,60));
		info.add(new Card("SR","쿨","[산들바람의 민스트럴] 우메키 오토하 ",true,41,3213,3614,3281,43,3921,4412,4005,
				"m","색채의 선율",false,"s",9,35,5,0,0,30));
		info.add(new Card("SR","패션","[치유의 만월] 오이카와 시즈쿠",true,37,4867,2455,3031,39,5940,2996,3700,
				"p","흰 우유빛의 효능",false,"v",15,35,5,0,0,60));
		info.add(new Card("SR","패션","[해피 브라이덜] 나탈리아",true,41,3774,3169,3049,43,4606,3868,3722,
				"m","트로피컬 댄스",false,"s",9,35,5,0,0,30));
		///////////////////////////////////////////////////////////////////////////////////////////
		info.add(new Card("SSR","큐트","[미스틱 엘릭서] 이치노세 시키",false,42,3178,3822,5770,44,3832,4608,6957,
				"s","케미컬 체인지",false,"i",11,35,6,17,0,90));
		info.add(new Card("SSR","큐트","[자칭·완벽] 코시미즈 사치코",false,42,4080,4866,4211,44,4920,5867,5077,
				"s","자칭·노린대로",false,"i",11,40,5,17,0,30));
		info.add(new Card("SSR","큐트","[필 마이 하트] 사쿠마 마유",false,42,5786,3165,3814,44,6976,3816,4599,
				"s","한결같은 사랑",false,"v",7,40,3,17,0,90));
		info.add(new Card("SSR","큐트","[캣 파티] 마에카와 미쿠",false,42,3790,5758,3142,44,4570,6943,3789,
				"s","고양이 스텝",false,"d",9,40,4,17,0,90));
		info.add(new Card("SSR","큐트","[게으른 왕국] 후타바 안즈",false,42,3811,3176,5716,44,4595,3830,6892,
				"s","왠지 잔뜩",false,"i",13,40,6,17,0,90));
		info.add(new Card("SSR","큐트","[스테이지 오브 매직] 시마무라 우즈키",false,42,4436,4387,4377,44,5349,5289,5278,
				"p","최고의 미소",false,"a",9,40,3,0,0,30));
		info.add(new Card("SSR","큐트","[꽃잎 흩날리는 절경] 코바야카와 사에",false,42,5809,3836,3185,44,7004,4625,3840,
				"s","꽃을 두른 듯한 노랫소리",false,"v",13,60,9,17,0,90));
		info.add(new Card("SSR","큐트","[따뜻한 하트] 가라시 쿄코",false,42,4031,4975,4189,44,4860,5998,5051,
				"s","촉촉 푹신 어레인지",false,"a",13,40,6,17,0,30));
		info.add(new Card("SSR","큐트","[애비뉴 모드] 미야모토 프레데리카",false,42,3160,5841,3820,44,3811,7043,4606,
				"s","밴덕 앙 드 트로아",false,"d",4,40,2,17,0,90));
		info.add(new Card("SSR","큐트","[마이 페어리테일] 오가타 치에리",false,42,3855,3201,5837,44,4648,3860,7037,
				"s","리틀 플립",false,"i",9,40,4,17,0,90));
		info.add(new Card("SSR","큐트","[스타팅 데이즈] 오토쿠라 유우키",false,42,5182,4118,3904,44,6248,4966,4707,
				"s","터치&런",false,"i",6,35,3,17,0,30));
		info.add(new Card("SSR","쿨","[빛나는 한때] 호죠 카렌",false,42,3177,3831,5820,44,3831,4619,7018,
				"s","계속되는 소원",false,"i",11,35,6,17,0,90));
		info.add(new Card("SSR","쿨","[오버 더 레인보우] 카미야 나오",false,42,3182,5765,3825,44,3837,6951,4612,
				"s","쾌청 이모션",false,"d",9,35,5,17,0,90));
		info.add(new Card("SSR","쿨","[엔들리스 나이트] 하야미 카나데",false,42,3828,3186,5760,44,4616,3842,6945,
				"s","시크릿 키스 사인",false,"i",13,40,6,17,0,90));
		info.add(new Card("SSR","쿨","[브라이트 메모리즈] 사기사와 후미카",false,42,3792,5752,3146,44,4572,6935,3793,
				"s","한순간 부는 바랍",false,"d",7,40,3,17,0,90));
		info.add(new Card("SSR","쿨","[노블 비너스] 닛타 미나미",false,42,3155,3797,5742,44,3805,4578,6923,
				"s","거스를 수 없는 고상함",false,"i",9,40,4,17,0,90));
		info.add(new Card("SSR","쿨","[장미의 암희] 칸자키 란코",false,42,5716,3811,3176,44,6892,4595,3830,
				"s","로젠˙슈투름",false,"v",11,40,5,17,0,90));
		info.add(new Card("SSR","쿨","[스테이지 오브 매직] 시부야 린",false,42,4377,4436,4387,44,5278,5349,5289,
				"p","달려나가는 의지",false,"a",12,40,4,0,0,30));
		info.add(new Card("SSR","쿨","[《우상》의 프래그먼트] 니노미야 아스카",false,42,5841,3160,3820,44,7043,3811,4606,
				"s","인사이드 비전",false,"v",6,35,3,17,0,90));
		info.add(new Card("SSR","쿨","[전율의 밤] 시라사카 코우메",false,42,4194,4040,4964,44,5057,4871,5985,
				"s","두근두근 팬더믹",false,"a",7,40,3,17,0,30));
		info.add(new Card("SSR","쿨","[야경의 새벽바람] 시오미 슈코 ",false,42,3904,5182,4118,44,4707,6248,4966,
				"s","애드립 스윙",false,"a",13,40,6,17,0,30));
		info.add(new Card("SSR","쿨","[루쥬 꾸뛰르] 미후네 미유 ",false,42,3839,5869,3176,44,4629,7076,3830,
				"s","울려퍼지는 발라드",false,"d",4,40,2,17,0,90));
		info.add(new Card("SSR","패션","[매쉬업★볼테이지] 호시 쇼코",false,42,4986,4184,4023,44,6012,5045,4851,
				"s","불타는 버섯볶음",false,"a",6,35,3,17,0,30));
		info.add(new Card("SSR","패션","[손으로 만드는 행복] 타카모리 아이코",false,42,5791,3161,3812,44,6982,3812,4596,
				"s","빛나는 스케일",false,"v",13,40,6,17,0,90));
		info.add(new Card("SSR","패션","[풀스윙☆엘] 히메카와 유키",false,42,3819,5775,3174,44,4605,6963,3828,
				"s","일곡☆입혼",false,"d",7,40,3,17,0,90));
		info.add(new Card("SSR","패션","[친구가 잔뜩] 이치하라 니나",false,42,5781,3817,3169,44,6970,4602,3821,
				"s","룬팟파♪",false,"v",11,40,5,17,0,90));
		info.add(new Card("SSR","패션","[스테이지 오브 매직] 혼다 미오",false,42,4387,4377,4436,44,5289,5278,5349,
				"p","넘치는 매력",false,"a",15,40,5,0,0,90));
		info.add(new Card("SSR","패션","[키라데코☆퍼레이드] 죠가사키 리카",false,42,3782,3129,5773,44,4561,3773,6960,
				"s","반짝반짝☆스마일",false,"i",7,40,3,17,0,30));
		info.add(new Card("SSR","패션","[그레이트 프레젠트] 모로보시 키라리",false,42,3176,5716,3811,44,3830,6892,4595,
				"s","키라링☆캔디",false,"d",9,40,4,17,0,90));
		info.add(new Card("SSR","패션","[꿈꾸는 프린세스] 키타 히나코",false,42,3168,5830,3826,44,3820,7029,4614,
				"s","히나코의 이야기",false,"d",4,40,2,17,0,90));
		info.add(new Card("SSR","패션","[해신의 인도자] 요리타 요시노",false,42,3168,3826,5830,44,3820,4614,7029,
				"s","정화의 의식",false,"i",9,35,5,17,0,90));
		info.add(new Card("SSR","패션","[발랄 하베스트] 오이카와 시즈쿠",false,42,5816,3866,3218,44,7012,4662,3881,
				"s","맹진 스텝",false,"v",6,35,3,17,0,90));
		info.add(new Card("SSR","패션","[마음 한 다발] 아이바 유미",false,42,5816,3866,3218,44,7012,4662,3881,
				"s","전하고 싶은 마음",false,"v",7,40,3,17,0,90));
		///////////////////////////////////////////////////////////////////////////////////////////
		info.add(new Card("SSR","큐트","[화이트 위치] 미무라 카나코",true,42,4015,4166,3984,44,4841,5023,4804,
				"h","크리미 매직",false,"l",10,40,3,3,0,30));
		info.add(new Card("SSR","큐트","[꿈빛 클로버] 오가타 치에리",true,42,5773,3782,3129,44,6960,4561,3773,
				"s","갓 태어난 바람",false,"v",7,35,4,15,0,90));
		info.add(new Card("SSR","큐트","[탱글탱글 우사밍] 아베 나나",true,42,3178,5770,3822,44,3832,6957,4608,
				"c","고 고 메르헨",false,"d",9,40,4,15,0,90));
		info.add(new Card("SSR","큐트","[유스풀 로맨스] 코히나타 미호",true,42,4757,4266,4167,44,5736,5144,5024,
				"s","네이키드 하트",false,"a",9,35,5,17,0,30));
		info.add(new Card("SSR","큐트","[로즈 플뢰르] 사쿠라이 모모카",true,42,3815,5851,3152,44,4600,7054,3801,
				"c","사랑의 장미",false,"d",11,40,50,15,0,90));
		info.add(new Card("SSR","큐트","[드리밍 브라이드] 마에카와 미쿠",true,42,3812,3089,6122,44,4596,3725,7381,
				"c","냥더풀 댄스",false,"v",11,40,5,15,0,90));
		info.add(new Card("SSR","큐트","[피스풀 데이즈] 시마무라 우즈키 ",true,42,5867,3807,3139,44,7074,4591,3785,
				"c","미소의 피스",false,"q",11,35,6,18,0,0));
		info.add(new Card("SSR","큐트","[게으름뱅이 페어리] 후타바 안즈 ",true,42,4028,4331,3967,44,4857,5222,4783,
				"h","가끔은 서비스",false,"l",11,40,4,3,0,30));
		info.add(new Card("SSR","쿨","[히트&비트] 타다 리이나",true,42,4017,3988,4161,44,4844,4808,5017,
				"h","정열의 온도",false,"l",13,40,5,3,0,30));
		info.add(new Card("SSR","쿨","[럭셔리 메모리] 카와시마 미즈키",true,42,4149,4254,4778,44,5003,5129,5761,
				"s","꺄르르르☆어필",false,"a",11,40,5,17,0,30));
		info.add(new Card("SSR","쿨","[밤바람의 유혹] 타카가키 카에데",true,42,5823,3796,3136,44,7021,4577,3782,
				"c","등을 미는 바람",false,"v",11,40,5,15,0,90));
		info.add(new Card("SSR","쿨","[크리스탈 스노우] 아나스타샤",true,42,5789,3117,3774,44,6980,3759,4550,
				"c","스노우 라이트 샤워",false,"v",7,35,4,15,0,90));
		info.add(new Card("SSR","쿨","[처음 짓는 표정] 타치바나 아리스",true,42,3963,4018,4290,44,4778,4845,5173,
				"h","흘러넘치는 순수한 마음",false,"l",11,40,4,3,0,30));
		info.add(new Card("SSR","쿨","[기다려지는 운명의 사람] 칸자키 란코",true,42,3135,3805,5872,44,3780,4588,7080,
				"c","영원의 계약",false,"i",9,40,4,15,0,90));
		info.add(new Card("SSR","쿨","[오버 마이셀프] 시부야 린",true,42,6122,3812,3089,44,7381,4596,3725,
				"c","보이기 시작한 별",false,"q",7,40,3,18,0,0));
		info.add(new Card("SSR","패션","[해피 휩] 아카기 미리아",true,42,3169,3817,5781,44,3821,4602,6970,
				"c","도레미파 스텝",false,"i",9,40,4,15,0,90));
		info.add(new Card("SSR","패션","[하트★오버플로우] 죠가사키 미카",true,42,4249,4790,4141,44,5123,5776,4993,
				"c","드리밍 사인",false,"a",9,40,4,17,0,30));
		info.add(new Card("SSR","패션","[버닝 프레젠트] 히노 아카네",true,42,4155,4020,3993,44,5010,4847,4815,
				"h","정열 딜리버리",false,"l",13,40,5,3,0,30));
		info.add(new Card("SSR","패션","[펌프킨 파티] 토토키 아이리",true,42,5768,3134,3785,44,6954,3779,4564,
				"c","스위트 트릭",false,"v",11,40,5,15,0,90));
		info.add(new Card("SSR","패션","[권화상등] 무카이 타쿠미",true,42,3947,4007,4310,44,4759,4831,5197,
				"h","애지천류",false,"l",11,40,4,3,0,30));
		info.add(new Card("SSR","패션","[이모셔널 비트] 키무라 나츠키",true,42,3810,3143,5862,44,4594,3790,7068,
				"c","울려퍼지는 열정",false,"i",13,40,6,15,0,90));
		info.add(new Card("SSR","패션","[원더 엔터테이너] 혼다 미오",true,42,3089,6122,3812,44,3725,7381,4596,
				"c","찬스를 붙잡아☆",false,"q",9,35,5,18,0,0));
		info.add(new Card("SSR","패션","[섬머타임☆하이] 오오츠키 유이",true,42,3845,5858,3184,44,4637,7063,3839,
				"c","어퍼 튠",false,"d",7,40,3,15,0,90));
		return info;
	}
	public ArrayList<String> returncardinfo(String type, String lev){
		switch(lev){
		case"All":{
			for(int i=0; i<204;i++){
					cardinfo.add(this.unlimitedinfo().get(i).Valueof());}
			break;
		}
		case"SSR":{
			switch(type){
			case"Cute":{
				for(int i=0; i<183;i++){
					if(this.unlimitedinfo().get(i).gettype().equals("Cute")){
						if(this.unlimitedinfo().get(i).getlev().equals("SSR")){
							cardinfo.add(this.unlimitedinfo().get(i).Valueof());
						}
					}
				}
				break;
			}
			case"Cool":{
				for(int i=0; i<183;i++){
					if(this.unlimitedinfo().get(i).gettype().equals("Cool")){
						if(this.unlimitedinfo().get(i).getlev().equals("SSR")){
							cardinfo.add(this.unlimitedinfo().get(i).Valueof());
						}
					}
				}
				break;
			}
			case"Passion":{
				for(int i=0; i<183;i++){
					if(this.unlimitedinfo().get(i).gettype().equals("Passion")){
						if(this.unlimitedinfo().get(i).getlev().equals("SSR")){
							cardinfo.add(this.unlimitedinfo().get(i).Valueof());
						}
					}
				}
				break;
			}
			}break;
		}
		case"SR":{
			switch(type){
			case"Cute":{
				for(int i=0; i<183;i++){
					if(this.unlimitedinfo().get(i).gettype().equals("Cute")){
						if(this.unlimitedinfo().get(i).getlev().equals("SR")){
							cardinfo.add(this.unlimitedinfo().get(i).Valueof());
						}
					}
				}
				break;
			}
			case"Cool":{
				for(int i=0; i<183;i++){
					if(this.unlimitedinfo().get(i).gettype().equals("Cool")){
						if(this.unlimitedinfo().get(i).getlev().equals("SR")){
							cardinfo.add(this.unlimitedinfo().get(i).Valueof());
						}
					}
				}
				break;
			}
			case"Passion":{
				for(int i=0; i<183;i++){
					if(this.unlimitedinfo().get(i).gettype().equals("Passion")){
						if(this.unlimitedinfo().get(i).getlev().equals("SR")){
							cardinfo.add(this.unlimitedinfo().get(i).Valueof());
						}
					}
				}
				break;
			}
			}break;
		}
		case"R":{
			switch(type){
			case"Cute":{
				for(int i=0; i<183;i++){
					if(this.unlimitedinfo().get(i).gettype().equals("Cute")){
						if(this.unlimitedinfo().get(i).getlev().equals("R")){
							cardinfo.add(this.unlimitedinfo().get(i).Valueof());
						}
					}
				}
				break;
			}
			case"Cool":{
				for(int i=0; i<183;i++){
					if(this.unlimitedinfo().get(i).gettype().equals("Cool")){
						if(this.unlimitedinfo().get(i).getlev().equals("R")){
							cardinfo.add(this.unlimitedinfo().get(i).Valueof());
						}
					}
				}
				break;
			}
			case"Passion":{
				for(int i=0; i<183;i++){
					if(this.unlimitedinfo().get(i).gettype().equals("Passion")){
						if(this.unlimitedinfo().get(i).getlev().equals("R")){
							cardinfo.add(this.unlimitedinfo().get(i).Valueof());
						}
					}
				}
				break;
			}
		}
		}break;
	}
		return cardinfo;
	}
}
