package Database;

import java.util.ArrayList;

public class RCard extends Card {
	ArrayList<Card> info = new ArrayList<Card>();
	public ArrayList<Card> info(){
		info.add(new Card("R","큐트","하야사카 미레이",false,27,2914,2905,2964,29,3623,3612,3685,
				"p","할퀴어 버릴거야",false,"a",13,30,6,0,0,10,
				"Image/card/100143_7061","Image/card/100144_7120"));
		info.add(new Card("R","큐트","하라다 미요",false,30,2554,3008,2464,32,3175,3740,3064,
				"h","나이스 핸들링",false,"l",9,30,4,2,0,10,
				"Image/card/100133_6460","Image/card/100134_6521"));
		info.add(new Card("R","큐트","효도 레나",false,27,2510,3857,2072,29,3121,4795,2576,
				"s","풀하우스",false,"d",9,30,6,10,0,30,
				"Image/card/100129_6221","Image/card/100130_6280"));
		info.add(new Card("R","큐트","모모이 아즈키",false,27,2473,3875,2025,29,3074,4817,2518,
				"c","우당탕 대작전",false,"d",7,30,5,8,0,30,
				"Image/card/100081_3460","Image/card/100082_3521"));
		info.add(new Card("R","큐트","도묘지 카린",false,30,2674,2664,2719,32,3325,3312,3380,
				"h","건강기원",false,"l",13,30,6,2,0,10,
				"Image/card/100079_3340","Image/card/100080_3400"));
		info.add(new Card("R","큐트","코시미즈 사치코",false,27,2510,2084,3801,29,3121,2591,4725,
				"c","자칭˙어필타임",false,"i",6,30,4,8,0,30,
				"Image/card/100073_2980","Image/card/100074_3040"));		
		info.add(new Card("R","큐트","아베 나나",false,27,2869,2967,2885,29,3567,3689,3587,
				"p","메르헨 체인지",false,"l",9,30,4,0,0,10,
				"Image/card/100037_1661","Image/card/100038_1721"));
		info.add(new Card("R","큐트","후타바 안즈",false,27,2632,2616,2613,29,3272,3252,3249,
				"p","적당히",false,"s",11,30,5,0,0,15,
				"Image/card/100028_1540","Image/card/100028_1601"));
		info.add(new Card("R","큐트","코바야카와 사에",false,27,3864,2478,2033,29,4803,3080,2527,
				"c","화사한 노래",false,"v",9,30,6,8,0,30,
				"Image/card/100023_1300","Image/card/100024_1360"));
		info.add(new Card("R","큐트","미야모토 프레데리카",false,27,2895,2934,2902,29,3599,3647,3608,
				"h","소악마 키스",false,"s",11,30,5,2,0,15,
				"Image/card/100021_1181","Image/card/100022_1240"));
		info.add(new Card("R","큐트","마에카와 미쿠",false,30,2396,2450,2405,32,2979,3046,2990,
				"h","네코 어필",false,"l",9,30,4,2,0,10,
				"Image/card/100019_1061","Image/card/100020_1120"));
		info.add(new Card("R","큐트","시마무라 우즈키",false,27,1815,2221,3497,29,2257,2761,4347,
				"s","퍼스트 스마일",false,"i",6,30,4,10,0,30,
				"Image/card/100001_0221","Image/card/100002_0281"));
		info.add(new Card("R","큐트","사키키바라 사토미",false,27,2105,3864,2539,29,2618,4803,3156,
				"s","천연 바디",false,"d",7,30,5,10,0,30,
				"Image/card/100195_9340","Image/card/100196_9400"));
		info.add(new Card("R","큐트","야오 페이페이",false,27,2539,2105,3864,29,3156,2618,4803
				,"s","홍콩풍 춤",false,"i",6,30,4,10,0,30,
				"Image/card/100207_0060","Image/card/100208_0121"));
		info.add(new Card("R","큐트","오오니시 유리코",false,27,2532,2078,3945,29,3148,2583,4904,
				"s","음흉한 토크",false,"i",7,30,5,10,0,30,
				"Image/card/100237_270","Image/card/100238_330"));
		info.add(new Card("R","큐트","아무라 세츠나",false,27,3852,2076,2513,29,4789,2581,3124,
				"s","메이크 업",false,"v",7,30,5,10,0,30,
				"Image/card/100131_6340","Image/card/100132_6400"));
		info.add(new Card("R","큐트","츠키미야 미야비",false,27,2550,3843,2121,29,3170,4777,2637,
				"c","엄마랑 닮은꼴",false,"d",6,30,4,8,0,30,
				"Image/card/100183_8740","Image/card/100184_8800"));
		info.add(new Card("R","큐트","시라기쿠 호타루",false,30,2728,2669,2656,32,3391,3319,3302,
				"p","포기하지 않는 마음",true,"l",12,30,4,0,0,10,
				"Image/card/100119_5620","Image/card/100120_5680"));
		info.add(new Card("R","큐트","사쿠마 마유",false,27,3938,1974,2442,29,4896,2454,3036,
				"s","리본 어필",false,"v",7,30,5,10,0,30,
				"Image/card/100089_3940","Image/card/100090_4000"));
		info.add(new Card("R","큐트","클라리스",false,27,2063,3828,2497,29,2565,4759,3104,
				"s","성스러운 노랫소리",false,"d",6,30,4,10,0,30,
				"Image/card/100105_4781","Image/card/100106_4840"));
		info.add(new Card("R","큐트","사이온지 코토카",false,27,1958,2431,3959,29,2435,3022,4922,
				"s","밀레이디 포즈",false,"i",9,30,6,10,0,30,
				"Image/card/100119_5620","Image/card/100120_5680"));
		info.add(new Card("R","큐트","쿠도 시노부",false,27,3859,2482,2037,29,4797,3086,2532,
				"c","첫걸음",false,"v",6,30,4,8,0,30,
				"Image/card/100113_5261","Image/card/100114_5320"));
		info.add(new Card("R","큐트","아리우라 칸나",false,27,3061,2865,2897,29,3805,3562,3601,
				"s","사랑의 노래",false,"a",7,30,5,10,0,10,
				"Image/card/100221_0661","Image/card/100222_0721"));
		info.add(new Card("R","쿨","와쿠이 루미",false,27,2518,2071,3906,29,3130,2575,4856,
				"p","프레젠테이션",false,"i",13,30,6,0,0,30,
				"Image/card/200207_1580","Image/card/200208_1640"));
		info.add(new Card("R","쿨","오카자키 야스하",false,30,2896,2552,2610,32,3600,3173,3245,
				"h","이노센트 보이스",false,"l",9,30,4,2,0,10,
				"Image/card/200153_8701","Image/card/200154_8760"));
		info.add(new Card("R","쿨","시라사카 코우메",false,27,2880,2860,2978,29,3581,3556,3702,
				"h","괴담",false,"l",11,30,5,2,0,10,
				"Image/card/200083_5100","Image/card/200084_5161"));
		info.add(new Card("R","쿨","아야세 호노카",false,27,2499,3822,2067,29,3106,4751,2570,
				"c","발레 스텝",false,"d",7,30,5,8,0,30,
				"Image/card/200077_4741","Image/card/200078_4800"));
		info.add(new Card("R","쿨","사죠 유키미",false,30,2673,2708,2678,32,3323,3366,3329,
				"h","퓨어 힐",false,"l",13,30,6,2,0,10,
				"Image/card/200075_4620","Image/card/200076_4680"));
		info.add(new Card("R","쿨","아나스타샤",false,30,2414,2411,2430,32,3001,2997,3021,
				"h","아이스 스마일",false,"l",9,30,4,2,0,10,
				"Image/card/200039_3181","Image/card/200040_3240"));
		info.add(new Card("R","쿨","하야미 카나데",false,27,2075,2505,3812,29,2580,3115,4739,
				"c","유혹의 키스",false,"i",6,30,4,8,0,30,
				"Image/card/200037_3061","Image/card/200038_3121"));
		info.add(new Card("R","쿨","호죠 카렌",false,27,2924,2907,2904,29,3635,3614,3611,
				"p","퓨어 워시",false,"s",9,30,4,0,0,15,
				"Image/card/200027_2940","Image/card/200028_3001"));
		info.add(new Card("R","쿨","칸자키 란코",false,27,2611,2603,2643,29,3246,3236,3286,
				"p","타락천사의 날개",false,"s",11,30,5,0,0,15,
				"Image/card/200025_2820","Image/card/200026_2880"));
		info.add(new Card("R","쿨","타카가키 카에데",false,27,3843,2050,2489,29,4777,2549,3094,
				"c","아우라",false,"v",9,30,6,8,0,30,
				"Image/card/200023_2701","Image/card/200024_2760"));
		info.add(new Card("R","쿨","시부야 린",false,27,3444,1857,2247,29,4281,2309,2793,
				"s","간직한 의지",false,"v",6,30,4,10,0,30,
				"Image/card/200001_1380","Image/card/200002_1440"));
		info.add(new Card("R","쿨","타카하시 레이코",false,30,2644,2887,2596,32,3287,3589,3228,
				"p","어른의 여유",true,"l",15,30,5,0,0,10,
				"Image/card/200245_2420","Image/card/200246_2481"));
		info.add(new Card("R","쿨","키바 마나미",false,30,2644,2887,2596,32,3287,3589,3228,
				"h","스토익 바디",false,"s",13,30,6,2,0,15,
				"Image/card/200231_391","Image/card/200232_451"));
		info.add(new Card("R","쿨","우메키 오토하",false,27,2791,3155,2851,29,3470,3923,3544,
				"c","퓨어 보이스",false,"s",6,30,4,8,0,15,
				"Image/card/200187_0621","Image/card/200188_0681"));
		info.add(new Card("R","쿨","오오이시 이즈미",false,27,2009,2471,3936,29,2498,3072,4893,
				"c","코딩",false,"i",7,30,5,8,0,30,
				"Image/card/200145_8460","Image/card/200146_8520"));
		info.add(new Card("R","쿨","후지이 토모",false,27,3920,2022,2478,29,4873,2514,3081,
				"s","스피리츄얼 파워",false,"v",9,30,6,10,0,30,
				"Image/card/200177_0021","Image/card/200178_0080"));
		info.add(new Card("R","쿨","라일라",false,27,2047,3889,2494,29,2545,4835,3101,
				"s","즐거운 수다",false,"d",7,30,5,10,0,30,
				"Image/card/200161_9060","Image/card/200162_9121"));
		info.add(new Card("R","쿨","유우키 하루",false,27,2895,2909,2974,29,3599,3617,3697,
				"p","강한 시선",false,"s",13,30,6,0,0,15,
				"Image/card/200141_8341","Image/card/200142_8400"));
		info.add(new Card("R","쿨","미즈노 미도리",false,27,3954,2033,2495,29,4916,2528,3102,
				"s","숨 고르기",false,"v",6,30,4,10,0,30,
				"Image/card/200185_0501","Image/card/200186_0561"));
		info.add(new Card("R","쿨","야가미 마키노",false,27,2457,3962,1988,29,3054,4925,2472,
				"s","정보분석",false,"d",9,30,6,10,0,30,
				"Image/card/200127_7501","Image/card/200128_7560"));
		info.add(new Card("R","쿨","모리쿠보 노노",false,27,3969,2426,1949,29,4934,3016,2423,
				"s","작은 노력",false,"v",7,30,5,10,0,30,
				"Image/card/200119_7020","Image/card/200120_7080"));
		info.add(new Card("R","쿨","와키야마 타마미",false,30,2651,2764,2628,32,3296,3436,3268,
				"p","기합",true,"l",12,30,4,0,0,10,
				"Image/card/200111_6540","Image/card/200112_6601"));
		info.add(new Card("R","쿨","니노미야 아스카",false,27,2499,2067,3822,29,3107,2570,4751,
				"s","익스텐드 컬러",false,"i",9,30,6,8,0,30,
				"Image/card/200093_5701","Image/card/200094_5761"));
		info.add(new Card("R","쿨","마츠나가 료",false,27,1966,3948,2436,29,2445,4908,3028,
				"s","라우드 보이스",false,"d",6,30,4,10,0,30,
				"Image/card/200021_2580","Image/card/200022_2640"));
		info.add(new Card("R","쿨","야마토 아키",false,27,2064,2505,3868,29,2567,3115,4809,
				"s","서바이벌 정신",false,"i",6,30,4,10,0,30,
				"Image/card/200125_7380","Image/card/200126_7441"));
		info.add(new Card("R","패션","츠치야 아코",false,27,3862,2508,2068,29,4801,3118,2571,
				"c","머니 어필",false,"v",7,30,5,8,0,30,
				"Image/card/300153_0221","Image/card/300154_0281"));
		info.add(new Card("R","패션","미요시 사나",false,27,2861,2887,3018,29,3557,3589,3752,
				"p","게이머 사고",false,"s",11,30,5,0,0,15,
				"Image/card/300157_0461","Image/card/300158_0520"));
		info.add(new Card("R","패션","코세키 레이나",false,27,2081,2515,3847,29,2588,3127,4783,
				"s","장난 타임",false,"i",6,30,4,10,0,30,
				"Image/card/300177_1420","Image/card/300178_1480"));
		info.add(new Card("R","패션","남바 에미",false,27,3931,2013,2473,29,4887,2503,3075,
				"s","츳코미 캐릭터",false,"v",9,30,6,10,0,30,
				"Image/card/300145_9741","Image/card/300146_9800"));
		info.add(new Card("R","패션","무라카미 토모에",false,27,3967,2455,1984,29,4931,3052,2467,
				"c","여자의 의지",false,"v",6,30,4,8,0,30,
				"Image/card/300129_8781","Image/card/300130_8840"));
		info.add(new Card("R","패션","키타 히나코",false,27,2487,2046,3849,29,3092,2544,4785,
				"s","소녀의 망상",false,"i",7,30,5,10,0,30,
				"Image/card/300121_8300","Image/card/300122_8361"));
		info.add(new Card("R","패션","무카이 타쿠미",false,27,2476,3870,2029,29,3078,4811,2523,
				"s","해프닝 키스",false,"d",6,30,4,10,0,30,
				"Image/card/300104_7341","Image/card/300105_7341"));
		info.add(new Card("R","패션","이치하라 니나",false,27,2054,2492,3838,29,2554,3098,4771,
				"s","창작 댄스",false,"i",9,30,6,10,0,30,
				"Image/card/300113_7820","Image/card/300114_7880"));
		info.add(new Card("R","패션","메어리 코크란",false,27,3964,1953,2429,29,4928,2428,3020,
				"s","레이디의 품격",false,"v",7,30,5,10,0,30,
				"Image/card/300099_6980","Image/card/300100_7041"));
		info.add(new Card("R","패션","하마구치 아야메",false,30,2624,2649,2769,32,3262,3294,3442,
				"p","스테이지 백화요란",false,"l",13,30,6,0,0,10,
				"Image/card/300093_6620","Image/card/300094_6680"));
		info.add(new Card("R","패션","와카바야시 토모카",false,27,2042,3854,2484,29,2539,4791,3088,
				"c","치어댄스",false,"d",7,30,5,8,0,30,
				"Image/card/300082_5961","Image/card/300083_6021"));
		info.add(new Card("R","패션","센자키 에마",false,27,2896,2886,2946,29,3600,3588,3663,
				"h","하이텐션",false,"s",11,30,5,2,0,15,
				"Image/card/300081_5901","Image/card/300082_5961"));
		info.add(new Card("R","패션","나탈리아",false,27,3791,2515,2092,29,4713,3127,2601,
				"c","정열 어필",false,"v",9,30,6,8,0,30,
				"Image/card/300075_5541","Image/card/300076_5601"));
		info.add(new Card("R","패션","토토키 아이리",false,27,2956,2891,2877,29,3675,3594,3576,
				"p","천연 해프닝",false,"l",9,30,4,0,0,10,
				"Image/card/300035_4341","Image/card/300036_4401"));
		info.add(new Card("R","패션","모로보시 키라리",false,30,2440,2409,2404,32,3034,2995,2989,
				"h","해피해피 포즈",false,"l",9,30,4,2,0,10,
				"Image/card/300033_4221","Image/card/300034_4280"));
		info.add(new Card("R","패션","히노 아카네",false,30,2699,2683,2680,32,3355,3335,3332,
				"h","전력 트라이",false,"l",13,30,6,2,0,10,
				"Image/card/300031_4101","Image/card/300032_4160"));
		info.add(new Card("R","패션","죠가사키 리카",false,27,2604,2595,2654,29,3237,3226,3300,
				"p","미니 GAL의 의지",false,"s",11,30,5,0,0,15,
				"Image/card/300029_3980","Image/card/300030_4041"));
		info.add(new Card("R","패션","죠가사키 미카",false,27,2494,2058,3833,29,3100,2558,4765,
				"c","GAL의 의지",false,"i",6,30,4,8,0,30,
				"Image/card/300027_3860","Image/card/300028_3921"));
		info.add(new Card("R","패션","혼다 미오",false,27,1882,3413,2263,29,2340,4243,2813,
				"s","포지티브 어필",false,"d",6,30,4,10,0,30,
				"Image/card/300001_2780","Image/card/300002_2841"));
		info.add(new Card("R","패션","코마츠 이부키",false,27,2492,3959,2029,29,3098,4922,2523,
				"s","유혹하는 댄스",false,"d",7,30,5,10,0,30,
				"Image/card/300189_2020","Image/card/300190_2081"));
		info.add(new Card("R","패션","나미키 메이코",false,30,2896,2640,2589,32,3600,3282,3219,
				"p","여행 기분",true,"l",12,30,4,0,0,10,
				"Image/card/300199_2621","Image/card/300200_2681"));
		info.add(new Card("R","패션","키타가와 마히로",false,27,2539,3864,2105,29,3156,4803,2618,
				"c","포지티브 대쉬",false,"d",9,30,6,8,0,30,
				"Image/card/300211_3221","Image/card/300212_3281"));
		info.add(new Card("R","패션","마키하라 시호",false,27,3875,2096,2534,29,4817,2606,3150,
				"s","스마일 오더",false,"v",6,30,4,10,0,30,
				"Image/card/300255_3820","Image/card/300256_3881"));
		return info;
	}
}