package Database;

import java.io.File;
import java.util.ArrayList;

public class SRCard extends Card {
	ArrayList<Card> info = new ArrayList<Card>();
	public ArrayList<Card> info(){
		info.add(new Card("SR","큐트","[섹시 캣] 마에카와 미쿠",false,37,3107,2577,4715,39,3792,3145,5755,
				"s","냥냥 아이즈",false,"i",9,35,5,15,0,60));
		info.add(new Card("SR","큐트","[포근한 스마일] 미무라 카나코",false,37,4862,3034,2460,39,5934,3703,3003,
				"s","감사의 마법",false,"v",11,35,6,15,0,60));
		info.add(new Card("SR","큐트","[수줍은 소녀] 코히나타 미호",false,37,3620,3603,3600,39,4419,4398,4394,
				"p","수줍은 미소",true,"s",12,35,5,0,0,30));
		info.add(new Card("SR","큐트","[소악마 메이드] 미야모토 프레데리카",false,37,2544,4757,3086,39,3106,5806,3766,
				"s","달콤한 유혹",false,"d",7,35,4,15,0,60));
		info.add(new Card("SR","큐트","[퓨어리 걸] 오쿠야마 사오리",false,37,3547,3685,3570,39,4329,4498,4357,
				"p","소박한 마음",false,"s",9,35,3,0,0,30));
		info.add(new Card("SR","큐트","[겨울의 멜로디] 오가타 치에리",false,41,3286,3259,3421,43,4011,3978,4175,
				"h","작은 마음",false,"l",11,35,4,3,0,20));
		info.add(new Card("SR","큐트","[리틀 프린세스] 후쿠야마 마이",false,41,3362,3315,3307,43,4104,4046,4037,
				"m","우아한 한때",false,"l",11,35,6,0,0,20));
		info.add(new Card("SR","큐트","[퍼퓸 트리퍼] 이치노세 시키",false,37,3081,4767,2535,39,3761,5818,3094,
				"s","눈뜨는 향기",false,"d",6,35,3,15,0,60));
		info.add(new Card("SR","큐트","[파이팅 치어] 나카노 유카",false,37,2569,3102,4725,39,3136,3786,5767,
				"s","열심히 응원!",false,"i",9,35,5,15,0,60));
		info.add(new Card("SR","큐트","[매지컬☆프리티 하트] 요코야마 치카",false,37,2517,4838,3079,39,3072,5905,3758,
				"s","매지컬☆프리티 체인지",false,"d",6,35,3,15,0,60));
		info.add(new Card("SR","큐트","[해피 매지션] 쿠도 시노부",false,37,4848,3074,2509,39,5917,3752,3063,
				"s","마법의 실크햇",false,"v",4,35,2,15,0,60));
		info.add(new Card("SR","큐트","[장밋빛 공주님] 사쿠라이 모모카",false,41,3053,3164,3724,43,3727,3862,4546,
				"h","공주님의 기지개",false,"l",17,35,6,3,0,20));
		info.add(new Card("SR","큐트","[팬시 걸] 이마이 카나",false,41,3073,3744,3185,43,3751,4570,3888,
				"h","이노센트 스마일",false,"l",11,35,4,3,0,20));
		info.add(new Card("SR","큐트","[청순한 아가씨] 미즈모토 유카리",false,37,4866,2533,3098,39,5939,3092,3781,
				"p","꿈의 무대",false,"s",7,40,2,0,0,30));
		info.add(new Card("SR","큐트","[꽃밭의 봄바람] 사이온지 코토카",false,41,3265,3583,3202,43,3985,4373,3909,
				"m","봄바람의 숨결",false,"l",7,35,4,0,0,20));
		info.add(new Card("SR","큐트","[비치 웨이브] 무라마츠 사쿠라",false,37,2608,3154,4821,39,3184,3850,5884,
				"p","웨이브 스마일",false,"i",9,35,3,0,0,60));
		info.add(new Card("SR","큐트","[선샤인 비치] 도묘지 카린 ",false,37,2582,4853,3138,39,3151,5924,3830,
				"p","한여름의 엑시던트",false,"i",9,35,3,0,0,60));
		info.add(new Card("SR","큐트","[드라이브 섬머] 하라다 미요",false,37,4811,3159,2616,39,5872,3856,3193,
				"o","톱 스피드",false,"i",9,35,16,5,15,60));
		info.add(new Card("SR","쿨","[안경 프린세스] 카미죠 하루나",false,37,2451,4872,3029,39,2992,5946,3697,
				"s","안경 파워",false,"d",6,35,15,15,0,60));
		info.add(new Card("SR","쿨","[꼬마 스테이지] 와키야마 타마미",false,37,3140,4782,2600,39,3833,5836,3173,
				"s","진검승부",false,"d",4,40,2,15,0,60));
		info.add(new Card("SR","쿨","[질풍의 스트라이커] 유우키 하루",false,37,3066,2483,4929,39,3742,3031,6016,
				"p","오버헤드 슛",false,"i",12,35,4,0,0,60));
		info.add(new Card("SR","쿨","[치유의 여신] 미후네 미유",false,37,3532,3827,3473,39,4311,4671,4239,
				"p","치유의 노랫소리",false,"s",18,35,6,0,0,30));
		info.add(new Card("SR","쿨","[영원한 공주님] 카와시마 미즈키",false,41,3029,3149,3754,43,3697,3843,4582,
				"m","어른의 아우라",false,"l",7,35,4,0,0,20));
		info.add(new Card("SR","쿨","[신비의 여신] 타카가키 카에데",false,37,3044,2476,4841,39,3715,3022,5908,
				"s","신비한 아우라",false,"i",11,35,6,15,0,60));
		info.add(new Card("SR","쿨","[반짝이는 소녀] 호죠 카렌",false,41,3341,3326,3323,43,4078,4060,4056,
				"h","빛나는 미소",false,"l",11,35,4,3,0,20));
		info.add(new Card("SR","쿨","[미소의 여신] 닛타 미나미",false,37,4736,2560,3097,39,5780,3125,3780,
				"s","미소의 매력",false,"v",9,35,5,15,0,60));
		info.add(new Card("SR","쿨","[신춘 록커] 타다 리이나",false,37,3065,4799,2510,39,3741,5857,3064,
				"s","뉴록 어필",false,"d",7,35,4,15,0,60));
		info.add(new Card("SR","쿨","[스타리 비치] 아나스타샤",false,37,3581,3565,3663,39,4371,4351,4471,
				"p","끝없는 바다",true,"s",12,35,5,0,0,30));
		info.add(new Card("SR","쿨","[쁘띠 마드모아젤] 사죠 유키미",false,37,3729,3548,3513,39,4551,4330,4288,
				"p","미스테리어스 스마일",false,"s",9,35,3,0,0,30));
		info.add(new Card("SR","쿨","[블루 플로트 파티] 아라키 히나",false,41,3275,3242,3441,43,3997,3957,4200,
				"m","터져나오는 자신",false,"l",11,35,6,0,0,20));
		info.add(new Card("SR","쿨","[록킹 보컬리스트] 마츠나가 료",false,41,3301,3391,3283,43,4030,4139,4007,
				"h","드라이브 샤우트",false,"l",8,35,3,3,0,20));
		info.add(new Card("SR","쿨","[나이트 엘레강스] 아이카와 치나츠",false,37,4872,3029,2451,39,5946,3697,2992,
				"s","야상의 노래",false,"v",9,35,5,15,0,60));
		info.add(new Card("SR","쿨","[쇼콜라 발렌타인] 모리쿠보 노노",false,37,2517,3079,4838,39,3072,3758,5905,
				"s","러블리 초콜렛",false,"i",7,35,4,15,0,60));
		info.add(new Card("SR","쿨","[두근두근☆챌린지] 아야세 호노카",false,41,3180,3754,3064,43,3882,4582,3740,
				"h","상냥한 마음",false,"l",11,35,4,3,0,20));
		info.add(new Card("SR","쿨","[섹시 뷰티] 마츠모토 사리나",false,37,4856,2541,3103,39,5927,3101,3787,
				"o","유혹 어필",false,"v",7,35,4,16,11,60));
		info.add(new Card("SR","쿨","[아름다운 신부] 와쿠이 루미",false,37,4898,3082,2508,39,5978,3762,3062,
				"s","행복의 종",false,"v",11,40,5,15,0,60));
		info.add(new Card("SR","쿨","[네이비 웨이브] 오오이시 이즈미",false,37,3653,3261,3182,39,4458,3981,3884,
				"h","웨이브 송",false,"s",17,35,6,3,0,60));
		info.add(new Card("SR","쿨","[포츈★스타] 후지이 토모",false,37,2612,4816,3156,39,3189,5878,3852,
				"p","행복의 전조",false,"d",18,35,6,0,0,60));
		info.add(new Card("SR","패션","[알레그로 기분] 마츠야마 쿠미코 ",false,37,2541,4856,3103,39,3101,5927,3787,
				"s","피아니시모 터치",false,"d",9,35,5,15,0,60));
		info.add(new Card("SR","패션","[남국의 무희] 마츠야마 쿠미코 ",false,37,3069,4859,2501,39,3746,5931,3053,
				"s","아름다음에 건 마음",false,"d",6,35,3,15,0,60));
		info.add(new Card("SR","패션","[나니와의 화려한 아가씨] 남바 에미",false,41,3714,3169,3061,43,4533,3868,3736,
				"h","나니와 리듬",false,"l",14,35,5,3,0,20));
		info.add(new Card("SR","패션","[록킹 러버] 키무라 나츠키",false,37,3559,3530,3707,39,4344,4309,4525,
				"p","오버 드라이브",false,"s",9,35,3,0,0,30));
		info.add(new Card("SR","패션","[스위트 발렌타인] 토토키 아이리",false,37,2527,3076,4778,39,3085,3755,5832,
				"s","스위트 포 유",false,"i",11,35,6,15,0,60));
		info.add(new Card("SR","패션","[복슬복슬 꼬리] 아카기 미리아",false,41,3274,3401,3295,43,3996,4151,4022,
				"h","푹신푹신 타임",false,"l",11,35,4,3,0,20));
		info.add(new Card("SR","패션","[카리스마 GAL] 죠가사키 미카",false,37,4694,3118,2594,39,5729,3806,3166,
				"s","핑키하트 블러섬",false,"v",7,35,4,15,0,60));
		info.add(new Card("SR","패션","[카리스마 미니 GAL] 죠가사키 리카",false,37,2493,4820,3055,39,3043,5883,3729,
				"s","풀파워 러브어택",false,"d",9,35,5,15,0,60));
		info.add(new Card("SR","패션","[전력 치어걸] 히메카와 유키",false,37,3582,3641,3593,39,4372,4444,4386,
				"p","머신건 응원",true,"s",12,35,5,0,0,30));
		info.add(new Card("SR","패션","[선플라워 옐로] 류자키 카오루",false,41,3290,3381,3306,43,4016,4126,4035,
				"m","해바라기 스마일",false,"l",11,35,6,0,0,20));
		info.add(new Card("SR","패션","[부드러운 소녀] 타카모리 아이코",false,37,3039,2468,4851,39,3709,3013,5920,
				"p","부드러운 미소",false,"i",12,35,4,0,0,60));
		info.add(new Card("SR","패션","[프레쉬 치어걸] 와카바야시 토모카",false,41,3452,3270,3234,43,4214,3991,3947,
				"p","치어풀 댄스!",true,"l",10,35,4,0,0,20));
		info.add(new Card("SR","패션","[문라이트 플라워] 아이바 유미",false,37,3576,3556,3674,39,4365,4341,4484,
				"s","문라이트 부케",false,"s",11,35,6,15,0,30));
		info.add(new Card("SR","패션","[데인져러스 어덜티] 카타기리 사나에",false,37,2534,3090,4817,39,3093,3772,5879,
				"s","파이트 한 발",false,"i",9,35,5,15,0,60));
		info.add(new Card("SR","패션","[일진 소녀] 무카이 타쿠미",false,37,3084,2526,4827,39,3764,3084,5891,
				"s","누님의 미소",false,"i",4,35,2,15,0,60));
		info.add(new Card("SR","패션","[소녀의 공부] 메어리 코크란",false,37,3593,3707,3569,39,4386,4525,4356,
				"p","공부의 성과",false,"s",6,35,2,0,0,30));
		info.add(new Card("SR","패션","[천일야화 무희] 나탈리아",false,37,4922,3037,2450,39,6008,3707,2991,
				"s","셀헤라자드 댄스",false,"v",9,35,5,15,0,60));
		info.add(new Card("SR","패션","[화려한 쿠노이치] 하마구치 아야메",false,37,3486,3548,3859,39,4255,4330,4710,
				"p","아이돌 변신 인술",false,"s",18,35,6,0,0,30));
		info.add(new Card("SR","패션","[인형옷 푹신푹신] 이치하라 니나",false,41,3323,3341,3432,43,4056,4078,4189,
				"m","인형옷 파워",false,"l",7,35,4,0,0,20));
		info.add(new Card("SR","패션","[고민할 나이] 야구치 미우",false,41,3089,3195,3724,43,3771,3900,4546,
				"h","포지티브 챌린지",false,"l",17,35,6,3,0,20));
		info.add(new Card("SR","패션","[설퍼 웨이브] 츠치야 아코",false,37,3148,2599,4832,39,3842,3172,5898,
				"s","웨이브 댄스",false,"i",7,40,3,15,0,60));
		info.add(new Card("SR","패션","[스쿨 데빌] 코세키 레이나",false,37,4832,2599,3148,39,5898,3172,3842,
				"o","장난 스피커",false,"i",7,35,16,4,11,60));
		return info;
	}
}