package Database;

import java.util.ArrayList;

public class SSRCard extends Card {
	ArrayList<Card> info = new ArrayList<Card>();
	public ArrayList<Card> info(){
		info.add(new Card("SSR","큐트","[미스틱 엘릭서] 이치노세 시키",false,42,3178,3822,5770,44,3832,4608,6957,
				"s","케미컬 체인지",false,"i",11,35,6,17,0,90,
				"Image/card/100153_7420","Image/card/100154_7481"));
		info.add(new Card("SSR","큐트","[자칭·완벽] 코시미즈 사치코",false,42,4080,4866,4211,44,4920,5867,5077,
				"s","자칭·노린대로",false,"i",11,40,5,17,0,30,
				"Image/card/100123_5860","Image/card/100124_5921"));
		info.add(new Card("SSR","큐트","[필 마이 하트] 사쿠마 마유",false,42,5786,3165,3814,44,6976,3816,4599,
				"s","한결같은 사랑",false,"v",7,40,3,17,0,90,
				"Image/card/100165_8020","Image/card/100166_8080"));
		info.add(new Card("SSR","큐트","[캣 파티] 마에카와 미쿠",false,42,3790,5758,3142,44,4570,6943,3789,
				"s","고양이 스텝",false,"d",9,40,4,17,0,90,
				"Image/card/100091_4060","Image/card/100092_4121"));
		info.add(new Card("SSR","큐트","[게으른 왕국] 후타바 안즈",false,42,3811,3176,5716,44,4595,3830,6892,
				"s","왠지 잔뜩",false,"i",13,40,6,17,0,90,
				"Image/card/100077_3220","Image/card/100078_3280"));
		info.add(new Card("SSR","큐트","[스테이지 오브 매직] 시마무라 우즈키",false,42,4436,4387,4377,44,5349,5289,5278,
				"p","최고의 미소",false,"a",9,40,3,0,0,30,
				"Image/card/100075_3100","Image/card/100076_3161"));
		info.add(new Card("SSR","큐트","[꽃잎 흩날리는 절경] 코바야카와 사에",false,42,5809,3836,3185,44,7004,4625,3840,
				"s","꽃을 두른 듯한 노랫소리",false,"v",13,60,9,17,0,90,
				"Image/card/100189_8981","Image/card/100190_9040"));
		info.add(new Card("SSR","큐트","[따뜻한 하트] 가라시 쿄코",false,42,4031,4975,4189,44,4860,5998,5051,
				"s","촉촉 푹신 어레인지",false,"a",13,40,6,17,0,30,
				"Image/card/100205_9940","Image/card/100206_0000"));
		info.add(new Card("SSR","큐트","[애비뉴 모드] 미야모토 프레데리카",false,42,3160,5841,3820,44,3811,7043,4606,
				"s","밴덕 앙 드 트로아",false,"d",4,40,2,17,0,90,
				"Image/card/100251_1140","Image/card/100252_1201"));
		info.add(new Card("SSR","쿨","[빛나는 한때] 호죠 카렌",false,42,3177,3831,5820,44,3831,4619,7018,
				"s","계속되는 소원",false,"i",11,35,6,17,0,90,
				"Image/card/200183_0381","Image/card/200184_0440"));
		info.add(new Card("SSR","쿨","[오버 더 레인보우] 카미야 나오",false,42,3182,5765,3825,44,3837,6951,4612,
				"s","쾌청 이모션",false,"d",9,35,5,17,0,90,
				"Image/card/200157_8940","Image/card/200158_9001"));
		info.add(new Card("SSR","쿨","[엔들리스 나이트] 하야미 카나데",false,42,3828,3186,5760,44,4616,3842,6945,
				"s","시크릿 키스 사인",false,"i",13,40,6,17,0,90,
				"Image/card/200137_8101","Image/card/200138_8160"));
		info.add(new Card("SSR","쿨","[브라이트 메모리즈] 사기사와 후미카",false,42,3792,5752,3146,44,4572,6935,3793,
				"s","한순간 부는 바랍",false,"d",7,40,3,17,0,90,
				"Image/card/200107_6301","Image/card/200108_6360"));
		info.add(new Card("SSR","쿨","[노블 비너스] 닛타 미나미",false,42,3155,3797,5742,44,3805,4578,6923,
				"s","거스를 수 없는 고상함",false,"i",9,40,4,17,0,90,
				"Image/card/200095_5820","Image/card/200096_5880"));
		info.add(new Card("SSR","쿨","[장미의 암희] 칸자키 란코",false,42,5716,3811,3176,44,6892,4595,3830,
				"s","로젠˙슈투름",false,"v",11,40,5,17,0,90,
				"Image/card/200073_4501","Image/card/200074_4561"));
		info.add(new Card("SSR","쿨","[스테이지 오브 매직] 시부야 린",false,42,4377,4436,4387,44,5278,5349,5289,
				"p","달려나가는 의지",false,"a",12,40,4,0,0,30,
				"Image/card/200071_4381","Image/card/200072_4441"));
		info.add(new Card("SSR","쿨","[《우상》의 프래그먼트] 니노미야 아스카",false,42,5841,3160,3820,44,7043,3811,4606,
				"s","인사이드 비전",false,"v",6,35,3,17,0,90,
				"Image/card/200197_1101","Image/card/200198_1161"));
		info.add(new Card("SSR","쿨","[전율의 밤] 시라사카 코우메",false,42,4194,4040,4964,44,5057,4871,5985,
				"s","두근두근 팬더믹",false,"a",7,40,3,17,0,30,
				"Image/card/200213_1820","Image/card/200214_1881"));
		info.add(new Card("SSR","쿨","[야경의 새벽바람] 시오미 슈코 ",false,42,3904,5182,4118,44,4707,6248,4966,
				"s","애드립 스윙",false,"a",13,40,6,17,0,30,
				"Image/card/200221_030","Image/card/200222_090"));
		info.add(new Card("SSR","패션","[매쉬업★볼테이지] 호시 쇼코",false,42,4986,4184,4023,44,6012,5045,4851,
				"s","불타는 버섯볶음",false,"a",6,35,3,17,0,30,
				"Image/card/300183_1661","Image/card/300184_1720"));
		info.add(new Card("SSR","패션","[손으로 만드는 행복] 타카모리 아이코",false,42,5791,3161,3812,44,6982,3812,4596,
				"s","빛나는 스케일",false,"v",13,40,6,17,0,90,
				"Image/card/300163_0701","Image/card/300164_0760"));
		info.add(new Card("SSR","패션","[풀스윙☆엘] 히메카와 유키",false,42,3819,5775,3174,44,4605,6963,3828,
				"s","일곡☆입혼",false,"d",7,40,3,17,0,90,
				"Image/card/300147_9860","Image/card/300148_9921"));
		info.add(new Card("SSR","패션","[친구가 잔뜩] 이치하라 니나",false,42,5781,3817,3169,44,6970,4602,3821,
				"s","룬팟파♪",false,"v",11,40,5,17,0,90,
				"Image/card/300123_8421","Image/card/300124_8480"));
		info.add(new Card("SSR","패션","[스테이지 오브 매직] 혼다 미오",false,42,4387,4377,4436,44,5289,5278,5349,
				"p","넘치는 매력",false,"a",15,40,5,0,0,90,
				"Image/card/300077_5660","Image/card/300078_5721"));
		info.add(new Card("SSR","패션","[키라데코☆퍼레이드] 죠가사키 리카",false,42,3782,3129,5773,44,4561,3773,6960,
				"s","반짝반짝☆스마일",false,"i",7,40,3,17,0,30,
				"Image/card/300107_7461","Image/card/300108_7521"));
		info.add(new Card("SSR","패션","[그레이트 프레젠트] 모로보시 키라리",false,42,3176,5716,3811,44,3830,6892,4595,
				"s","키라링☆캔디",false,"d",9,40,4,17,0,90,
				"Image/card/300079_5781","Image/card/300080_5841"));
		info.add(new Card("SSR","패션","[꿈꾸는 프린세스] 키타 히나코",false,42,3168,5830,3826,44,3820,7029,4614,
				"s","히나코의 이야기",false,"d",4,40,2,17,0,90,
				"Image/card/300201_2741","Image/card/300202_2801"));
		info.add(new Card("SSR","패션","[해신의 인도자] 요리타 요시노",false,42,3168,3826,5830,44,3820,4614,7029,
				"s","정화의 의식",false,"i",9,35,5,17,0,90,
				"Image/card/300217_3461","Image/card/300218_3521"));
		info.add(new Card("SSR","패션","[발랄 하베스트] 오이카와 시즈쿠",false,42,5816,3866,3218,44,7012,4662,3881,
				"s","맹진 스텝",false,"v",6,35,3,17,0,90,
				"Image/card/300225_511","Image/card/300226_570"));
		return info;
	}
}
