package Database;

import java.util.ArrayList;

public class SSRCardLimited extends Card {
	ArrayList<Card> info = new ArrayList<Card>();
	public ArrayList<Card> info(){
		info.add(new Card("SSR","큐트","[화이트 위치] 미무라 카나코",true,42,4015,4166,3984,44,4841,5023,4804,
				"h","크리미 매직",false,"l",10,40,3,3,0,30));
		info.add(new Card("SSR","큐트","[꿈빛 클로버] 오가타 치에리",true,42,5773,3782,3129,44,6960,4561,3773,
				"s","갓 태어난 바람",false,"v",7,35,4,15,0,90));
		info.add(new Card("SSR","큐트","[탱글탱글 우사밍] 아베 나나",true,42,3178,5770,3822,44,3832,6957,4608,
				"c","고 고 메르헨",false,"d",9,40,4,15,0,90));
		info.add(new Card("SSR","큐트","[유스풀 로맨스] 코히나타 미호",true,42,4757,4266,4167,44,5736,5144,5024,
				"s","네이키드 하트",false,"a",9,35,5,17,0,30));
		info.add(new Card("SSR","큐트","[로즈 플뢰르] 사쿠라이 모모카",true,42,3815,5851,3152,44,4600,7054,3801,
				"c","사랑의 장미",false,"d",11,40,50,15,0,90));
		info.add(new Card("SSR","큐트","[드리밍 브라이드] 마에카와 미쿠",true,42,5867,3807,3139,44,7074,4591,3785,
				"c","냥더풀 댄스",false,"v",11,40,5,15,0,90));
		info.add(new Card("SSR","쿨","[히트&비트] 타다 리이나",true,42,4017,3988,4161,44,4844,4808,5017,
				"h","정열의 온도",false,"l",13,40,5,3,0,30));
		info.add(new Card("SSR","쿨","[럭셔리 메모리] 카와시마 미즈키",true,42,4149,4254,4778,44,5003,5129,5761,
				"s","꺄르르르☆어필",false,"a",11,40,5,17,0,30));
		info.add(new Card("SSR","쿨","[밤바람의 유혹] 타카가키 카에데",true,42,5823,3796,3136,44,7021,4577,3782,
				"c","등을 미는 바람",false,"v",11,40,5,15,0,90));
		info.add(new Card("SSR","쿨","[크리스탈 스노우] 아나스타샤",true,42,5789,3117,3774,44,6980,3759,4550,
				"c","스노우 라이트 샤워",false,"v",7,35,4,15,0,90));
		info.add(new Card("SSR","쿨","[처음 짓는 표정] 타치바나 아리스",true,42,3963,4018,4290,44,4778,4845,5173,
				"h","흘러넘치는 순수한 마음",false,"l",11,40,4,3,0,30));
		info.add(new Card("SSR","쿨","[기다려지는 운명의 사람] 칸자키 란코",true,42,3135,3805,5872,44,3780,4588,7080,
				"c","영원의 계약",false,"i",9,40,4,15,0,90));
		info.add(new Card("SSR","패션","[해피 휩] 아카기 미리아",true,42,3169,3817,5781,44,3821,4602,6970,
				"c","도레미파 스텝",false,"i",9,40,4,15,0,90));
		info.add(new Card("SSR","패션","[하트★오버플로우] 죠가사키 미카",true,42,4249,4790,4141,44,5123,5776,4993,
				"c","드리밍 사인",false,"a",9,40,4,17,0,30));
		info.add(new Card("SSR","패션","[버닝 프레젠트] 히노 아카네",true,42,4155,4020,3993,44,5010,4847,4815,
				"h","정열 딜리버리",false,"l",13,40,5,3,0,30));
		info.add(new Card("SSR","패션","[펌프킨 파티] 토토키 아이리",true,42,5768,3134,3785,44,6954,3779,4564,
				"c","스위트 트릭",false,"v",11,40,5,15,0,90));
		info.add(new Card("SSR","패션","[권화상등] 무카이 타쿠미",true,42,3947,4007,4310,44,4759,4831,5197,
				"h","애지천류",false,"l",11,40,4,3,0,30));
		info.add(new Card("SSR","패션","[이모셔널 비트] 키무라 나츠키",true,42,3810,3143,5862,44,4594,3790,7068,
				"c","울려퍼지는 열정",false,"i",13,40,6,15,0,90));
		return info;
	}
}